DataProcessors/УниверсальныйОбменДаннымиXDTO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>УниверсальныйОбменДаннымиXDTO</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗаданияНаСнятиеПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНаСнятиеПоказанийПриборовУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраничнаяДатаСъема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКвартир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЖивут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетСпецКомунТранс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетТеплосеть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндОтопление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЖЕК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Другое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/УниверсальныйОбменДаннымиXDTO/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПЕРЕМЕННЫЕ МОДУЛЯ ДЛЯ НАПИСАНИЯ АЛГОРИТМОВ (ОБЩИЕ ДЛЯ ВЫГРУЗКИ И ЗАГРУЗКИ)

Перем НоваяФабрика;				// Фабрика XDTO конфигурации-приемника
Перем НовыйСериализатор;		// Сериализатор XDTO конфигурации-приемника
Перем ПустойУИД;				// Пустой Уникальный идентификатор

Перем ЗаписьXML;				// Предназначена для организации последовательной записи XML
Перем ЧтениеXML;				// Предназначена для организации последовательного чтения XML

Перем СтруктураОтвета;

Перем ИсключенныеСвойства;
Перем ТипУдалениеОбъекта;

Перем ПеременныеИнициализированы;

////////////////////////////////////////////////////////////////////////////////
// ТОЧКИ ВХОДА

// Возвращает сообщение обмена в виде строки
//
// Параметры:
//  Нет
// 
//  Возвращаемое значение:
// Структура, состоящая из 3-х элементов:
// Отказ 				- флаг сообщения об ошибке, 
// ИнформацияОбОшибке 	- текстовая информация об ошибке
// Данные 				- сформированный пакет обмена
Функция СформироватьПакетОбмена() Экспорт
	
	ИнициализацияРеквизитовИМодульныхПеременных();
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
    ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);					
    
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
    
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		Попытка
			// Записываем данные в сообщение
			Данные = ВыборкаИзменений.Получить();
			ВыгрузитьОбъект(Данные);
		Исключение
			ЗаписатьИнформациюОбОшибке("Ошибка при выгрузке объекта """ + Строка(Данные) + """: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат СтруктураОтвета;
		КонецПопытки;
    КонецЦикла;
    
	ЗаписьСообщения.ЗакончитьЗапись();
	
	СтруктураОтвета.Данные = ЗаписьXML.Закрыть();
	
	Возврат СтруктураОтвета;
    
КонецФункции

// Читает сообщение обмена, переданное в виде строки
//
// Параметры:
//  ДанныеОбмена - Строка - сообщение обмена в виде строки
//
//  Возвращаемое значение:
// Структура, состоящая из 3-х элементов:
// Отказ 				- флаг сообщения об ошибке, 
// ИнформацияОбОшибке 	- текстовая информация об ошибке
// Данные 				- пустая строка
Функция ПринятьПакетОбмена(ДанныеОбмена) Экспорт
	
	ИнициализацияРеквизитовИМодульныхПеременных();
	
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена);
    ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	Попытка
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	Исключение
		ЗаписатьИнформациюОбОшибке("Ошибка на сервере при получении данных: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат СтруктураОтвета;
	КонецПопытки;
		
	НачатьТранзакцию();
	
	Попытка
		ПрочитатьСообщениеОбмена(ЧтениеXML, ЧтениеСообщения.Отправитель);
	Исключение
		ЗаписатьИнформациюОбОшибке("Ошибка на сервере при получении данных: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		Возврат СтруктураОтвета;
	КонецПопытки;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель,ЧтениеСообщения.НомерПринятого);
	
	ЗафиксироватьТранзакцию();
    
    ЧтениеСообщения.ЗакончитьЧтение();
    ЧтениеXML.Закрыть();
	
	Возврат СтруктураОтвета;
    
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ

// Инициализирует реквизиты обработки и модульные переменные
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияРеквизитовИМодульныхПеременных()
	
	Если ПеременныеИнициализированы Тогда
		Возврат;
	КонецЕсли;
	
	// Возвращаемое значение. Содержит либо пакет обмена, либо информацию об ошибке
	СтруктураОтвета 					= Новый Структура("Отказ, ИнформацияОбОшибке, Данные");
	СтруктураОтвета.Отказ 				= Ложь;
	СтруктураОтвета.ИнформацияОбОшибке 	= "";
	СтруктураОтвета.Данные			 	= "";
	
	// Проверка обязательных реквизитов
	Если УзелОбмена.Пустая() Тогда
		ЗаписатьИнформациюОбОшибке("Не указан узел обмена данными.");
		Возврат;
	КонецЕсли;
	
	// Инициализация глобальных переменных модуля
	НоваяФабрика 		= ПолучитьФабрикуXDTO();
	
	Если НоваяФабрика = Неопределено Тогда
		// Информация об ошибке уже записана в структуре ответа, делаем возврат
		Возврат;
	КонецЕсли;
	
	НовыйСериализатор 	= Новый СериализаторXDTO(НоваяФабрика);
	
	ПустойУИД 			= "00000000-0000-0000-0000-000000000000";
	ТипОбъекта			= Тип("УдалениеОбъекта");
	
	ЗаписьXML 			= Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЧтениеXML 			= Новый ЧтениеXML;
	
	ПеременныеИнициализированы = Истина;
	
КонецПроцедуры

// Получает фабрику XDTO на основании загруженной xsd-схемы из макета плана обмена.
//
// Параметры:
//  Нет.
// Возвращаемое значение:
// Фабрика XDTO
Функция ПолучитьФабрикуXDTO()
	
	// 1. Получаем макет, в котором хранится xsd-схема мобильного приложения
	Попытка
		МакетПравил = ПланыОбмена[УзелОбмена.Метаданные().Имя].ПолучитьМакет("XSDСхемаМобильногоПриложения");
		СхемаXMLСтрокой = МакетПравил.ПолучитьТекст();
	Исключение
		ЗаписатьИнформациюОбОшибке("Для плана обмена не найден макет с xsd-схемой мобильного приложения.");
		Возврат Неопределено;
	КонецПопытки;
	
	// 2. Читаем xsd-схему, используя DOM-модель
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СхемаXMLСтрокой);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	Исключение
		ЗаписатьИнформациюОбОшибке("Ошибка при чтении xsd-схемы мобильного приложения: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	// 3. Получаем схему xml-документа
	Попытка
		ПостроительСхемыXML = Новый ПостроительСхемXML;
		СхемаXML = ПостроительСхемыXML.СоздатьСхемуXML(ДокументDOM);
		НаборСхемXML = Новый НаборСхемXML;
		НаборСхемXML.Добавить(СхемаXML);
	Исключение
		ЗаписатьИнформациюОбОшибке("Ошибка при создании схемы xml-документа: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	// 4. Создаем фабрику XDTO на основании прочитанной схемы
	Попытка
		Фабрика = Новый ФабрикаXDTO(НаборСхемXML);
	Исключение
		ЗаписатьИнформациюОбОшибке("Ошибка при создании Фабрики XDTO на основании схемы: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Фабрика;
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ВЫГРУЗКА ДАННЫХ

// Производит выгрузку объекта
//
// Параметры:
//  Данные					 - выгружаемые данные
Процедура ВыгрузитьОбъект(Данные) Экспорт
	
	// Инициализация внутренних переменных этой процедуры
	Отказ = Ложь;
	ИсключенныеСвойства = Новый СписокЗначений;
	
	// 1. Действия перед выгрузкой
	Попытка
		ОбработчикСобытияПередВыгрузкойОбъекта(Данные, Отказ, ИсключенныеСвойства);
	Исключение
		ВызватьИсключение "Ошибка в обработчике ""Перед выгрузкой объекта"": " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьИсключенныеСвойстваАнгийскимиСинонимами(ИсключенныеСвойства);
	
	// 2. Подготовка к выгрузке
	ОбъектXDTO  	= ПолучитьОбъектXDTO(Данные);
	
	// 3. Выгрузка
	ОбработчикСобытияПриВыгрузкеОбъекта(ОбъектXDTO, Данные, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НоваяФабрика.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	
	// 4. После выгрузки
	ОбработчикСобытияПослеВыгрузкиОбъекта(Данные);
	
КонецПроцедуры

// Возвращает заполненный объект или значение XDTO, созданный из объекта ИБ
//
// Параметры:
//  Данные				- Произвольные данные
//  ТипXDTO				- Тип объекта, на основании которого требуется создать новую фабрику (не обязательный)
//
// Возвращаемое значение:
// заполненный объект или значение XDTO, созданный на основании полученных данных
Функция ПолучитьОбъектXDTO(Данные, ТипXDTO = Неопределено)
	
	ОбъектXDTO = ПолучитьПустойОбъектXDTO(ТипXDTO, Данные);
	ЗаполнитьСвойстваПриемника(ОбъектXDTO, Данные);
	Возврат ОбъектXDTO;
	
КонецФункции

// Заполняет все возможные свойства приемника - ОбъектXDTO свойствами Источника - Данные
//
// Параметры:
//  ОбъектXDTO						 - Приемник
//  Данные							 - Источник
Процедура ЗаполнитьСвойстваПриемника(ОбъектXDTO, Данные)
	
	Если ТипЗнч(ОбъектXDTO) = Тип("ЗначениеXDTO") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СвойстваПриемника = ОбъектXDTO.Свойства();
	Исключение
		Возврат;
	КонецПопытки;
	
	ЭтоРегистр			= ЭтоРегистр(Данные);
	ЭтоОтбор			= ТипЗнч(Данные) = Тип("Отбор");
	ЭтоЭлементОтбора	= ТипЗнч(Данные) = Тип("ЭлементОтбора");
	
	Для Каждого Свойство Из СвойстваПриемника Цикл
		
		Если ИсключенныеСвойства.НайтиПоЗначению(Свойство.Имя) <> Неопределено Тогда
			Продолжить;
		ИначеЕсли ЭтоЭлементОтбора Тогда
			// В отборе "ВидСравнения" всегда "равно", а "ЗначениеС" и "ЗначениеПо" пустые.
			// Если их выгрузить, то объект при загрузке не сериализуется.
			// Также нет смысла выгружать признак "Использование", т.к. он всегда установлен в Истина
			Если Свойство.Имя = "ComparisonType"
				ИЛИ Свойство.Имя = "ValueFrom"
				ИЛИ Свойство.Имя = "ValueTo"
				ИЛИ Свойство.Имя = "Usage" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			// Если это Период, то необходимо в объект записать англоязычный синоним Period, иначе объект не сериализуется
			Если Свойство.Имя = "Name" И Данные.Имя = "Период" Тогда
				
				ЗначениеСвойства = "Period";
				ЗначениеXDTO = ПолучитьОбъектXDTO(ЗначениеСвойства, Свойство.Тип);
				ОбъектXDTO.Установить(Свойство, ЗначениеXDTO);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(ОбъектXDTO[Свойство.Имя]) = Тип("СписокXDTO") Тогда // Свойство является коллекцией
			Для Каждого ЗначениеЭлемента Из ?(ЭтоРегистр ИЛИ ЭтоОтбор, Данные, Данные[Свойство.Имя]) Цикл
				ЗначениеXDTO = ПолучитьОбъектXDTO(ЗначениеЭлемента, Свойство.Тип);
				ОбъектXDTO[Свойство.Имя].Добавить(ЗначениеXDTO);
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		// 1. Попытаемся получить значение свойства из источника по имени свойства в приемнике.
		// Если неудачно - то такого свойства в источнике нет, присваиваем ему пустое значение.
		Попытка
			ЗначениеСвойства = Данные[Свойство.Имя];
		Исключение
			
			Если Свойство.ВозможноПустое Тогда
				ЗначениеСвойства = Неопределено;
			Иначе
				ЗначениеСвойства = ПолучитьПустойОбъектXDTO(Свойство.Тип);
			КонецЕсли;
			
			Попытка
				ОбъектXDTO.Установить(Свойство, ЗначениеСвойства);
			Исключение
			КонецПопытки;
			
			Продолжить;
			
		КонецПопытки;
		
		// 2. Если полученное значение равно NULL, значит, это выгружается группа
		Если ЗначениеСвойства = NULL Тогда
			ОбъектXDTO.Сбросить(Свойство);
			Продолжить;
		КонецЕсли;
		
		// 3. Присваиваем полученное свойство источника свойству приемника
		Попытка
			ЗначениеXDTO = ПолучитьОбъектXDTO(ЗначениеСвойства, Свойство.Тип);
			ОбъектXDTO.Установить(Свойство, ЗначениеXDTO);
		Исключение
			ВызватьИсключение "Не удалось передать свойство " + Свойство.Имя + " по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает пустой объект XDTO или значение XDTO. Если переданы данные, то созданный Объект XDTO будет заполнен 
//
// Параметры:
//  ТипXDTO				- Тип объекта, на основании которого требуется создать новую фабрику (не обязательный)
//  Данные				- Произвольные данные (не обязательный)
//
// Возвращаемое значение:
// пустой объект XDTO или значение XDTO, созданный на основании полученных данных
Функция ПолучитьПустойОбъектXDTO(Знач ТипXDTO = Неопределено, Знач Данные = Неопределено)
	
	ТипПередан = ТипXDTO <> Неопределено;
	
	Попытка
		
		Если НЕ ТипПередан Тогда
			ТипXDTO = ОпределитьТипXDTO(Данные);
		КонецЕсли;
		
		Если ТипЗнч(ТипXDTO) = Тип("ТипОбъектаXDTO") Тогда
			Данные = Неопределено;
		ИначеЕсли Данные = Неопределено Тогда
			Данные = ПолучитьПустоеЗначениеПоТипуXDTO(ТипXDTO);
		КонецЕсли;
		
		Попытка
			ОбъектXDTO = НоваяФабрика.Создать(ТипXDTO, Данные);
		Исключение
			Если ТипПередан Тогда
				// Возможно передан неверный тип. Определим тип самостоятельно,
				// и попытаемся создать объект XDTO на основании нашего типа
				ТипXDTO = ОпределитьТипXDTO(Данные);
				ОбъектXDTO = НоваяФабрика.Создать(ТипXDTO, Данные);
			Иначе
				ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецЕсли;
		КонецПопытки;
		
	Исключение
		ВызватьИсключение "Не удалось создать пустой объект XDTO для " + Строка(Данные) + " по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ОбъектXDTO;
	
КонецФункции

// Возвращает тип объекта XDTO или тип значения XDTO для переданного объекта
//
// Параметры:
//  Данные				- Произвольные данные
//
// Возвращаемое значение:
// Тип объекта XDTO или Тип значения XDTO
Функция ОпределитьТипXDTO(Данные)
	
	ТипДанныхXML 	= НовыйСериализатор.XMLТипЗнч(Данные);
	Если ТипДанныхXML = Неопределено Тогда
		ВызватьИсключение "Не удалось определить тип XML для " + Строка(Данные) + ".";
	КонецЕсли;
	
	ТипXDTO = НоваяФабрика.Тип(ТипДанныхXML);
	Если ТипXDTO = Неопределено Тогда
		ВызватьИсключение "Не удалось определить тип XDTO для " + Строка(Данные) + ". Имя типа данных XML: " + ТипДанныхXML.ИмяТипа;
	КонецЕсли;
	
	Возврат ТипXDTO;
	
КонецФункции

// Возвращает пустое значение, соответствующее типу XDTO
//
// Параметры:
//  ТипXDTO				- Тип XDTO
//
// Возвращаемое значение:
// Пустое значение с типом Строка, Число, Булево, Дата, либо пустой УИД
Функция ПолучитьПустоеЗначениеПоТипуXDTO(ТипXDTO)
	
	// Возвращаемое значение
	Перем ПустоеЗначение;
	
	ПустоеЗначение = ПолучитьПустоеЗначениеПоИмениТипа(ТипXDTO.Имя);
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПолучитьПустоеЗначениеПоИмениТипа(ТипXDTO.БазовыйТип.Имя);
	КонецЕсли;
	
	Возврат ПустоеЗначение;

КонецФункции

// Возвращает пустое значение, соответствующее имени типа
//
// Параметры:
//  ИмяТипа				- Имя типа
//
// Возвращаемое значение:
// Пустое значение с типом Строка, Число, Булево, Дата, либо пустой УИД
Функция ПолучитьПустоеЗначениеПоИмениТипа(ИмяТипа)
	
	// Возвращаемое значение
	ПустоеЗначение = Неопределено;
	
	// Если это ссылочный тип, то присваиваем выгружаемому значению пустую ссылку
	Если ИмяТипа = "AnyRef"
		Или ИмяТипа = "UUID" Тогда
		
		ПустоеЗначение = ПустойУИД;
		
	// Если это простой тип, то присваиваем значение напрямую
	ИначеЕсли ИмяТипа = "string" Тогда
		
		ПустоеЗначение = "";
		
	ИначеЕсли ИмяТипа = "boolean" Тогда
		
		ПустоеЗначение = Ложь;
		
	ИначеЕсли ИмяТипа = "dateTime" Тогда
		
		ПустоеЗначение = Дата("00010101");
		
	ИначеЕсли ИмяТипа = "decimal" Тогда
		
		ПустоеЗначение = 0;
		
	ИначеЕсли ИмяТипа = "ValueStorage" Тогда
		
		ПустоеЗначение = Новый ХранилищеЗначения(Неопределено);
		
	Иначе
		
		// Какой-то неизвестный тип
		ПустоеЗначение = Неопределено;
		
	КонецЕсли;
	
	Возврат ПустоеЗначение;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА ДАННЫХ

Процедура ПрочитатьСообщениеОбмена(ЧтениеXML, Отправитель)
	
	Отказ = Ложь;
	
	Пока НовыйСериализатор.ВозможностьЧтенияXML(ЧтениеXML) Цикл
		
		ТипОбъектаXML = ПолучитьXMLТип(ЧтениеXML);
		
		// Попытаемся получить Тип, соответствущий этой ИБ
		ТипОбъекта = СериализаторXDTO.ИзXMLТипа(ТипОбъектаXML);
		
		Если ТипОбъекта = Неопределено Тогда
			// Неизвестный тип. Выходим
			ВызватьИсключение "Не удалось определить тип объекта (" + ТипОбъекта.ИмяТипа + ").";
		КонецЕсли;
		
		Если ТипОбъекта = ТипУдалениеОбъекта Тогда
			//ОтработатьУдалениеОбъекта(Данные);
			Продолжить;
		КонецЕсли;
		
		Менеджер = ПолучитьМенеджер(ТипОбъекта);
		
		Попытка
			Данные = НоваяФабрика.ПрочитатьXML(ЧтениеXML);
		Исключение
			ВызватьИсключение "Не удалось прочитать объект; скорее всего, xsd-схема мобильного приложения устарела. Информация об ошибке: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если ЭтоСсылочныйТип(Менеджер) Тогда
			ОбъектЭтойБазы = ПолучитьОбъектСсылочногоТипа(Данные, ТипОбъектаXML, Менеджер);
			ОбработчикСобытияПередЗаписьюОбъектаСсылочногоТипа(ОбъектЭтойБазы, Отказ);
			Если НЕ Отказ Тогда
				ЗаписатьОбъектВИБ(ОбъектЭтойБазы, Отправитель);
			КонецЕсли;
		Иначе
			НаборЗаписей = ПолучитьОбъектРегистр(Данные, ТипОбъектаXML, Менеджер);
			ОбработчикСобытияПередЗаписьюРегистра(НаборЗаписей, Отправитель, Отказ);
			Если НЕ Отказ Тогда
				ЗаписатьОбъектВИБ(НаборЗаписей, Отправитель);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Записывает в глобальную переменную СтруктураОтвета информацию об ошибке
//
// Параметры:
//  ИнформацияОбОшибке			- ИнформацияОбОшибке, Строка.
Процедура ЗаписатьИнформациюОбОшибке(ИнформацияОбОшибке)
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		СтрокаОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	Иначе
		СтрокаОшибки = ИнформацияОбОшибке;
	КонецЕсли;
	
	СтруктураОтвета.Отказ 				= Истина;
	СтруктураОтвета.ИнформацияОбОшибке 	= СтрокаОшибки;
	
КонецПроцедуры

// Добавляет к списку исключенных свойств, заданных пользователем, английские синонимы,
// т.к. предопределенные реквизиты в XDTO представляются в виде английских слов.
// Например, Имя - Name
//
// Параметры:
//  ИсключенныеСвойства - Структура - Список исключенных свойств
Процедура ДополнитьИсключенныеСвойстваАнгийскимиСинонимами(ИсключенныеСвойства)
	
	///////////// Набор записей /////////////
	Если ИсключенныеСвойства.НайтиПоЗначению("Период") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Period");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Активность") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Active");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Регистратор") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Recorder");
	КонецЕсли;
	
	///////////// Справочники /////////////
	Если ИсключенныеСвойства.НайтиПоЗначению("Наименование") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Name");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Код") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Code");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("ПометкаУдаления") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("DeletionMark");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Владелец") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Owner");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Ссылка") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("ref");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Родитель") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("parent");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("ЭтоГруппа") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("IsFolder");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("ИмяПредопределенныхДанных") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("PredefinedDataName");
	КонецЕсли;

	
	///////////// Документы /////////////
	Если ИсключенныеСвойства.НайтиПоЗначению("Дата") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Date");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Номер") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Number");
	КонецЕсли;
	
	Если ИсключенныеСвойства.НайтиПоЗначению("Проведен") <> Неопределено Тогда
		ИсключенныеСвойства.Добавить("Posted");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМенеджер(ТипОбъекта)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОбъекта);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ВызватьИсключение "Не удалось определить объект метаданных, соответствующий нужному тип объекта (" + ТипОбъекта + ").";
	КонецЕсли;
	
	// Объекты, которые есть на мобильной платформе
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат Справочники[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат Документы[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Возврат РегистрыСведений[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		Возврат РегистрыНакопления[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		Возврат Константы[ОбъектМетаданных.Имя];
	
	// Настольная платформа
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		Возврат РегистрыБухгалтерии[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат РегистрыРасчета[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		Возврат ПланыВидовХарактеристик[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		Возврат БизнесПроцессы[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		Возврат Задачи[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		Возврат ПланыСчетов[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат ПланыВидовРасчета[ОбъектМетаданных.Имя];
		
	ИначеЕсли Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных) Тогда
		Возврат ЖурналыДокументов[ОбъектМетаданных.Имя];

	Иначе
		ВызватьИсключение "Не удалось определить принадлежность объекта к основным типам конфигурации (" + ТипОбъекта.ИмяТипа + ").";
	КонецЕсли;
	
	
КонецФункции

Функция ЭтоСсылочныйТип(Менеджер)
	
	Попытка
		Менеджер.ПустаяСсылка();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОбъектСсылочногоТипа(ОбъектXDTO, ТипОбъекта, Менеджер)
	
	// 1. Получам XDTO-объект этой базы
	ОбъектXDTOЭтойБазы = ПолучитьXDTOОбъектЭтойБазы(ТипОбъекта);
	
	// 2. Получим строку пустых свойств, и исключим их их списка копируемых,
	// чтобы процедура ЗаполнитьЗначениеСвойств отработала верно
	СписокИсключенныхСвойствXDTO = ПолучитьСписокИсключенныхСвойствXDTO(ОбъектXDTO);
	
	// 3. Заполняем полученные объект всеми возможными свойствами из загружаемого объекта
	ЗаполнитьЗначенияСвойств(ОбъектXDTOЭтойБазы, ОбъектXDTO);
	
	// 4. Незаполненные свойства дозаполняем пустыми значениями, чтобы объект смог сериализоваться.
	// Также получам список незаполненных свойств, чтобы в последствии заполнить их из существующего объекта ИБ (если он в ней был)
	СписокСвойств = ДозаполнитьИПолучитьСписокПустыхСвойств(ОбъектXDTOЭтойБазы, ОбъектXDTO, СписокИсключенныхСвойствXDTO, Менеджер);
	
	// 5. Сериализуем загружаемый объект
	ОбъектЭтойБазы = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTOЭтойБазы);
	
	// 6. Если объект существует в ИБ - заполняем отсутствующие в источнике свойства из ссылки.
	Если НЕ ОбъектЭтойБазы.ЭтоНовый() Тогда
		ЗаполнитьОтсутствующиеСвойстваОбъектаПоСписку(ОбъектЭтойБазы, ОбъектЭтойБазы.Ссылка, СписокСвойств);
	КонецЕсли;
	
	Возврат ОбъектЭтойБазы;
	
КонецФункции

Функция ПолучитьXDTOОбъектЭтойБазы(ТипXML)
	
	ТипXDTO = ФабрикаXDTO.Тип(ТипXML);
	Если ТипXDTO = Неопределено Тогда
		ВызватьИсключение "Не удалось получить нужный тип из фабрики XDTO (" + ТипXML.ИмяТипа + ").";
	КонецЕсли;
	
	Попытка
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
	Исключение
		ВызватьИсключение "Не удалось получить объект XDTO.";
	КонецПопытки;
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ПолучитьСписокИсключенныхСвойствXDTO(ОбъектXDTO)
	
	//// Возвращаемое значение
	//СписокИсключенныхСвойствXDTO = Новый СписокЗначений;
	//
	//ТипОбъектXDTO = ОбменДаннымиМобПриложениеПовтИсп.ПолучитьТипОбъектXDTO();
	//	
	//Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
	//	Если ТипЗнч(ОбъектXDTO.Получить(Свойство)) = ТипОбъектXDTO Тогда
	//		СписокИсключенныхСвойствXDTO.Добавить(Свойство.Имя);
	//		ОбъектXDTO[Свойство.Имя] = "";
	//	КонецЕсли;
	//КонецЦикла;
	//	
	//Возврат СписокИсключенныхСвойствXDTO;
	
КонецФункции

Функция ДозаполнитьИПолучитьСписокПустыхСвойств(ОбъектXDTOЭтойБазы, ОбъектXDTO, СписокИсключенныхСвойствXDTO, Менеджер)
	
	// Возвращаемое значение
	СписокПустыхСвойств = Новый СписокЗначений;
	
	ЭтоГруппа = ОбъектXDTO.Получить("IsFolder");
		
	Если ЭтоГруппа = "true" Тогда
		ЭтоГруппа = Истина;
	Иначе
		ЭтоГруппа = Ложь;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		ПустойОбъектЭтойБазы = Менеджер.СоздатьГруппу();
		ВызватьИсключение "!";
	Иначе
		ПустойОбъектЭтойБазы = Менеджер.СоздатьЭлемент();
	КонецЕсли;
	
	Для Каждого Свойство Из ОбъектXDTOЭтойБазы.Свойства() Цикл
		Если ОбъектXDTOЭтойБазы.Получить(Свойство) = Неопределено
			И ПустойОбъектЭтойБазы[Свойство.Имя] <> NULL
			И СписокИсключенныхСвойствXDTO.НайтиПоЗначению(Свойство.Имя) = Неопределено Тогда
			СписокПустыхСвойств.Добавить(Свойство.Имя);
			ОбъектXDTOЭтойБазы[Свойство.Имя] = ПустойОбъектЭтойБазы[Свойство.Имя];
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПустыхСвойств;
	
КонецФункции

Процедура ЗаполнитьОтсутствующиеСвойстваОбъектаПоСписку(Приемник, Источник, СписокСвойств)
	
	Для Каждого Свойство Из СписокСвойств Цикл
		Приемник[Свойство.Значение] = Источник[Свойство.Значение];
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОбъектВИБ(ОбъектЭтойБазы, Отправитель)
	
	Попытка
		УстановитьПризнакОбменаДанными(ОбъектЭтойБазы, Отправитель);
		ОбъектЭтойБазы.Записать();
	Исключение
		ВызватьИсключение "Не удалось записать объект: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;	
	
КонецПроцедуры

Функция ПолучитьОбъектРегистр(ОбъектXDTO, ТипОбъекта, Менеджер)
	
	// 1. Получам XDTO-объект этой базы
	ОбъектXDTOЭтойБазы = ПолучитьXDTOОбъектЭтойБазы(ТипОбъекта);
	
	// 2. Читаем отбор
	СвойствоОтбор = ОбъектXDTOЭтойБазы.Свойства().Получить("filter");
	ОбъектОтбор = ФабрикаXDTO.Создать(СвойствоОтбор.Тип);
	СвойствоЭлементОтбора = СвойствоОтбор.Тип.Свойства.Получить("filteritem");
	Для Каждого ЭлементОтбора Из ОбъектXDTO.filter.filteritem Цикл
		ОбъектЭлементОтбора = ФабрикаXDTO.Создать(СвойствоЭлементОтбора.Тип);
		Для Каждого Свойство Из ЭлементОтбора.Свойства() Цикл
			Попытка
				ОбъектЭлементОтбора[Свойство.Имя] = ЭлементОтбора[Свойство.Имя];
			Исключение
				ТипXML = СериализаторXDTO.XMLТипЗнч(ЭлементОтбора[Свойство.Имя]);
				ТипXDTO = ФабрикаXDTO.Тип(ТипXML.URIПространстваИмен, ТипXML.ИмяТипа);
				ЗначениеXDTO = ФабрикаXDTO.Создать(ТипXDTO, ЭлементОтбора[Свойство.Имя]);
				ОбъектЭлементОтбора[Свойство.Имя] = ЗначениеXDTO;
			КонецПопытки;
		КонецЦикла;
		ОбъектОтбор.filteritem.Добавить(ОбъектЭлементОтбора);
	КонецЦикла;
	
	ОбъектXDTOЭтойБазы.Установить(СвойствоОтбор, ОбъектОтбор);
	
	// 3. Читаем набор записей
	Если ОбъектXDTO.Свойства().Получить("Record") <> Неопределено Тогда // Самих записей может и не быть
		СвойствоЗапись = ОбъектXDTOЭтойБазы.Свойства().Получить("Record");
		ОбъектЗапись = ФабрикаXDTO.Создать(СвойствоЗапись.Тип);
		Для Каждого Свойство Из ОбъектXDTO.record.Свойства() Цикл
			Попытка
				ОбъектЗапись[Свойство.Имя] = ОбъектXDTO.record[Свойство.Имя];
			Исключение
				ТипXML = СериализаторXDTO.XMLТипЗнч(ОбъектXDTO.record[Свойство.Имя]);
				ТипXDTO = ФабрикаXDTO.Тип(ТипXML.URIПространстваИмен, ТипXML.ИмяТипа);
				ЗначениеXDTO = ФабрикаXDTO.Создать(ТипXDTO, ОбъектXDTO.record[Свойство.Имя]);
				ОбъектЗапись[Свойство.Имя] = ЗначениеXDTO;
			КонецПопытки;
		КонецЦикла;
		ОбъектXDTOЭтойБазы.record.Добавить(ОбъектЗапись);
	КонецЕсли;
	
	// 4. Незаполненные свойства дозаполняем пустыми значениями, чтобы объект смог сериализоваться.
	ДозаполнитьПустыеСвойстваРегистра(ОбъектXDTOЭтойБазы, ОбъектXDTO, Менеджер);
	
	// 5. Сериализуем загружаемый объект
	ОбъектЭтойБазы = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTOЭтойБазы);
	
	Возврат ОбъектЭтойБазы;
	
КонецФункции

Процедура ДозаполнитьПустыеСвойстваРегистра(ОбъектXDTOЭтойБазы, ОбъектXDTO, Менеджер)
	
	ПустойМенеджерЭтойБазы = Менеджер.СоздатьМенеджерЗаписи();
	
	Если ОбъектXDTOЭтойБазы.record.Количество() > 0 Тогда
	
		Для Каждого Свойство Из ОбъектXDTOЭтойБазы.record[0].Свойства() Цикл
			
			Если ОбъектXDTOЭтойБазы.record[0].Получить(Свойство) = Неопределено Тогда
				
				Для Каждого Запись Из ОбъектXDTOЭтойБазы.record Цикл
					Запись[Свойство.Имя] = ПустойМенеджерЭтойБазы[Свойство.Имя];
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПризнакОбменаДанными(Объект, Отправитель)
	
	Попытка
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.ОбменДанными.Отправитель = Отправитель;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// УНИВЕРСАЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверить, что значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение       - ссылка на объект - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  Булево       - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение)
	
	Попытка
		А = Значение.Ссылка;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Определяет принадлежность объекта метаданных к типу регистр
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоРегистр(Объект)
	
	Попытка
		ОбъектМетаданных = Объект.Метаданные();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	ИмяБазовогоТипа = ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
	
	Возврат ИмяБазовогоТипа = "РегистрыСведений"
		ИЛИ ИмяБазовогоТипа = "РегистрыНакопления"
		ИЛИ ИмяБазовогоТипа = "РегистрыБухгалтерии"
		ИЛИ ИмяБазовогоТипа = "РегистрыРасчета";
	
КонецФункции

// Возвращает имя базового типа по переданному значению объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, по которому необходимо определить базовый тип
// 
// Возвращаемое значение:
//  Строка - имя базового типа по переданному значению объекта метаданных
//
Функция ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных)
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат "Справочники";
		
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат "Документы";
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Возврат "РегистрыСведений";
				
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		Возврат "РегистрыНакопления";
		
	ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		Возврат "Константы";
		
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланыОбмена";

	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		Возврат "РегистрыБухгалтерии";
		
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат "РегистрыРасчета";
		
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Возврат "Перечисления";
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланыВидовХарактеристик";
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		Возврат "БизнесПроцессы";
		
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		Возврат "Задачи";
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланыСчетов";
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланыВидовРасчета";
		
	ИначеЕсли Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных) Тогда
		Возврат "ЖурналыДокументов";
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип данных: " + Строка(ОбъектМетаданных);
		
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработчикСобытияПередВыгрузкойОбъекта(Объект, Отказ, ИсключенныеСвойства)
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗаданияНаСнятиеПоказанийПриборовУчета") Тогда
		
		ИсключенныеСвойства.Добавить("Регистратор"); // Дозаполним в обработчике "После отправки объекта"
		
		// Обработаем ситуацию, когда в документе поменяли исполнителя
		Если Объект.Количество() > 0 И Объект[0].Исполнитель <> УзелОбмена Тогда
			Отказ = Истина;
			// За компанию отправим инфу об очистке записей регистра
			УдаляемыйНабор = РегистрыСведений.ЗаданияНаСнятиеПоказанийПриборовУчета.СоздатьНаборЗаписей();
			УдаляемыйНабор.Отбор.Регистратор.Установить(Объект.Отбор.Регистратор.Значение);
			ВыгрузитьОбъект(УдаляемыйНабор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикСобытияПриВыгрузкеОбъекта(ОбъектXDTO, Объект, Отказ)
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("СправочникОбъект.ЗданияИСооружения") Тогда
		
		// Сформируем адрес для мобильного устройства вида <Улица>, <Дом>
		// Например, Дерибасовская, 22
		СтруктураПоиска = Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения);
		НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СписокПолей = УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(НайденныеСтроки[0].ЗначенияПолей);
			МассивДомУлица = Новый Массив(2);
			Для Каждого Поле Из СписокПолей Цикл
				Если Поле.Представление = "Улица" Тогда
					МассивДомУлица[0] = Поле.Значение;
				ИначеЕсли Поле.Представление = "Дом" Тогда
					МассивДомУлица[1] = Поле.Значение;
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(МассивДомУлица[0]) И ЗначениеЗаполнено(МассивДомУлица[1]) Тогда
				ОбъектXDTO.Description = МассивДомУлица[0] + ", " + МассивДомУлица[1];
				
				// Попытаемся определить номер дома
				НомерЗдания = 0;
				Попытка
					НомерЗдания = Число(МассивДомУлица[1]);
				Исключение
					// Номер может храниться в формате "22ж" - попробуем выделить цифры из номера
					НомерСтрокой = "";
					Для Счетчик = 1 По СтрДлина(МассивДомУлица[1]) Цикл
						Символ = Сред(МассивДомУлица[1], Счетчик, 1);
						Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда
							НомерСтрокой = НомерСтрокой + Символ;
						КонецЕсли;
					КонецЦикла;
					Если НомерСтрокой <> 0 Тогда
						Попытка
							НомерЗдания = Число(НомерСтрокой);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецПопытки;
				
				ОбъектXDTO.НомерЗдания = НомерЗдания;
			Иначе
				ОбъектXDTO.Description = Объект.Наименование;
				ОбъектXDTO.НомерЗдания = 0;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ОбъектыЛицевыхСчетов") Тогда
		
		ОбъектXDTO.Description = "Квартира " + Объект.Код + Объект.Суффикс;
		
		// Получение ФИО владельца лицевого счета
		
		// Для начала получим ссылку на лицевой счет
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЛицевыеСчета.Ссылка
		               |ПОМЕСТИТЬ ВтСчет
		               |ИЗ
		               |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		               |ГДЕ
		               |	ЛицевыеСчета.ОбъектЛицевогоСчета = &ОбъектЛицевогоСчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Наименование КАК ФИО,
		               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Наименование КАК НомерСчета
		               |ИЗ
		               |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
		               |			&Период,
		               |			ЛицевойСчет В
		               |				(ВЫБРАТЬ
		               |					ВтСчет.Ссылка
		               |				ИЗ
		               |					ВтСчет КАК ВтСчет)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
					   
		Запрос.УстановитьПараметр("ОбъектЛицевогоСчета", Объект.Ссылка);
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбъектXDTO.ВладелецЛицевогоСчета = Выборка.ФИО;
			ОбъектXDTO.НомерСчета = Выборка.НомерСчета;
		Иначе
			ОбъектXDTO.ВладелецЛицевогоСчета = "Аноним"; // Не оставлять же владельца пустым
			ОбъектXDTO.НомерСчета = "";
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ПриборыУчета") Тогда
		
		Если ЗначениеЗаполнено(Объект.Услуга) И ЗначениеЗаполнено(Объект.Услуга.ВидУслуги) Тогда
			ОбъектXDTO.ВидУслуги = Объект.Услуга.ВидУслуги.Наименование;
		Иначе
			ОбъектXDTO.ВидУслуги = "Неизвестный счетчик";
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗаданияНаСнятиеПоказанийПриборовУчета") Тогда
		
		Регистратор = Объект.Отбор[0].Значение;
		ТипСлужебныйРегистратор = НоваяФабрика.Тип("http://v8.1c.ru/8.1/data/enterprise/current-config", "DocumentRef.Служебный_РегистраторДляРегистра");
		ОбъектСлужебныйРегистратор = НоваяФабрика.Создать(ТипСлужебныйРегистратор, Регистратор.УникальныйИдентификатор());
		
		// Заполним отбор
		ОтборОбъектXDTO = НоваяФабрика.Создать(ОбъектXDTO.Свойства().Получить("filter").Тип);
		ЭлементОтбораXDTO = НоваяФабрика.Создать(ОтборОбъектXDTO.Свойства().Получить("filteritem").Тип);
		ЭлементОтбораXDTO.Name = "Recorder";
		ЭлементОтбораXDTO.Установить("Value", ОбъектСлужебныйРегистратор);
		ОтборОбъектXDTO.Filteritem.Добавить(ЭлементОтбораXDTO);
		ОбъектXDTO.Установить("Filter", ОтборОбъектXDTO);
		
		// Дозаполним набор записей
		Для Каждого ЗаписьXDTO Из ОбъектXDTO.Record Цикл
			ЗаписьXDTO.Установить("Recorder", ОбъектСлужебныйРегистратор);
		КонецЦикла;
		
		Если ОбъектXDTO.Record.Количество() > 0 Тогда
			ТипСлужебныйРегистратор = НоваяФабрика.Тип("http://v8.1c.ru/8.1/data/enterprise/current-config", "DocumentObject.Служебный_РегистраторДляРегистра");
			ОбъектСлужебныйРегистратор = НоваяФабрика.Создать(ТипСлужебныйРегистратор);
			ОбъектСлужебныйРегистратор.Ref = Регистратор.УникальныйИдентификатор();
			ОбъектСлужебныйРегистратор.Установить("Date", Регистратор.Дата);
			ОбъектСлужебныйРегистратор.Установить("Posted", Ложь);
			ОбъектСлужебныйРегистратор.Установить("DeletionMark", Ложь);
			НоваяФабрика.ЗаписатьXML(ЗаписьXML, ОбъектСлужебныйРегистратор);
		Иначе
			// Отправляем удаление документа
			ТипУдалениеОбъекта = НоваяФабрика.Тип("http://v8.1c.ru/8.1/data/enterprise", "ObjectDeletion");
			ОбъектУдалениеОбъекта = НоваяФабрика.Создать(ТипУдалениеОбъекта);
			ОбъектУдалениеОбъекта.Установить("Ref", ОбъектСлужебныйРегистратор);
			НоваяФабрика.ЗаписатьXML(ЗаписьXML, ОбъектУдалениеОбъекта);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикСобытияПослеВыгрузкиОбъекта(Объект)
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗаданияНаСнятиеПоказанийПриборовУчета") И Объект.Количество() > 0 Тогда
		
		// Вручную выгружаем справочники, которые есть в записях
		// Выгружаем дом
		ВыгрузитьОбъект(Объект[0].Здание.ПолучитьОбъект());
		
		// Выгружаем квартиры и счетчики
		// Для квартир будем использовать кэш, т.к. у одной квартиры может быть несколько счетчиков
		КэшКвартир = Новый Соответствие;
		Для Каждого Запись Из Объект Цикл
			КлючВыгружаемыхДанных = ЗначениеВСтрокуВнутр(Запись.ОбъектЛицевогоСчета);
			Если КэшКвартир[КлючВыгружаемыхДанных] = Неопределено Тогда
				ВыгрузитьОбъект(Запись.ОбъектЛицевогоСчета.ПолучитьОбъект());
				КэшКвартир.Вставить(КлючВыгружаемыхДанных, Запись.ОбъектЛицевогоСчета);
			КонецЕсли;
			
			// Счетчик
			ВыгрузитьОбъект(Запись.ПриборУчета.ПолучитьОбъект());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикСобытияПередЗаписьюОбъектаСсылочногоТипа(Объект, Отказ)
	
	
	
КонецПроцедуры

Процедура ОбработчикСобытияПередЗаписьюРегистра(ОбъектЭтойБазы, Отправитель, Отказ)
	
	Для Каждого Запись Из ОбъектЭтойБазы Цикл
		Запись.Исполнитель = Отправитель;
	КонецЦикла;
	
КонецПроцедуры

ПеременныеИнициализированы = Ложь;
